# Exercise 4.9. PART 1

## Task 3:

In [94]:
# Importing analysis libraries

import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

#creating path
path=r'C:\Users\Olufemi\Downloads\CareerFoundry Data Analyics\Instacart Basket Analysis 03_02_2025'

# importing dataframe
df = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

## Task 4: Data Wrangling

In [96]:
# Check the new DataFrame
df.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [98]:
# Check the dimensions of the dataframe
df.shape

(206209, 10)

In [100]:
# Renaming the Columns
df = df.rename(columns={ 
    'Surnam' : 'Last Name', 
    'STATE' : 'State', 
    'date_joined' : 'Date Joined', 
    'n_dependants' : 'Number of Dependents', 
    'fam_status' : 'Family Status', 
    'income' : 'Income'})

In [102]:
df.columns

Index(['user_id', 'First Name', 'Last Name', 'Gender', 'State', 'Age',
       'Date Joined', 'Number of Dependents', 'Family Status', 'Income'],
      dtype='object')

In [104]:
df.head()

,user_id,First Name,Last Name,Gender,State,Age,Date Joined,Number of Dependents,Family Status,Income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [106]:
# Check the descriptive statistics of df dataframe
df.describe()

             user_id            Age  Number of Dependents         Income
count  206209.000000  206209.000000         206209.000000  206209.000000
mean   103105.000000      49.501646              1.499823   94632.852548
std     59527.555167      18.480962              1.118433   42473.786988
min         1.000000      18.000000              0.000000   25903.000000
25%     51553.000000      33.000000              0.000000   59874.000000
50%    103105.000000      49.000000              1.000000   93547.000000
75%    154657.000000      66.000000              3.000000  124244.000000
max    206209.000000      81.000000              3.000000  593901.000000

In [59]:
# Checking & finding missing values
NaN_Values = df.isnull().sum()

In [45]:
NaN_Values

user_id             0
First Name      11259
Surnam              0
Gender              0
STATE               0
Age                 0
date_joined         0
n_dependants        0
fam_status          0
income              0
dtype: int64

In [61]:
# finding duplicate rows
duplicates = df.duplicated()

In [63]:
# See the rows that are duplicates:
duplicate_rows = df[duplicates]
print(duplicate_rows)

Empty DataFrame
Columns: [USER_ID, First Name, Last Name, Gender, State, Age, Date Joined, Number of Dependents, Family Status, Income]
Index: []

## The output demonstrates that the 'df' DataFrame is devoid of duplicate entries.

In [108]:
# df column types
df.dtypes

user_id                  int64
First Name              object
Last Name               object
Gender                  object
State                   object
Age                      int64
Date Joined             object
Number of Dependents     int64
Family Status           object
Income                   int64
dtype: object

In [116]:
# Change the data type of the specified columns using astype()
columns_to_convert = ['user_id', 'Income', 'Number of Dependents']

for col in columns_to_convert:
    df[col] = df[col].astype('int32')

In [118]:
# Verify the changes
print(df.dtypes)

user_id                  int32
First Name              object
Last Name               object
Gender                  object
State                   object
Age                      int64
Date Joined             object
Number of Dependents     int32
Family Status           object
Income                   int32
dtype: object

###  Task 5: The data quality and consistency checks are performed and the results are all ***good, no issues!***

# Task 6: Combining the cleaned customer data with prepared Instacart data

In [120]:
# Importing ords_prods_merge dataframe
ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'aggregated_ords_prods_merge.pkl'))

In [122]:
# Combining customer (df) DataFrame with ords_prods_merge DataFrame
merged_df = pd.merge(ords_prods_merge, df, on='user_id', how='inner')

In [125]:
merged_df.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'merged_df.pkl'))